Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_dfsdm.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32H743_dfsdm.
; ================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32H743_dfsdm equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// DFSDM address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    CHCFG0R1;
    volatile    uint32_t    CHCFG1R1;
    volatile    uint32_t    CHCFG2R1;
    volatile    uint32_t    CHCFG3R1;
    volatile    uint32_t    CHCFG4R1;
    volatile    uint32_t    CHCFG5R1;
    volatile    uint32_t    CHCFG6R1;
    volatile    uint32_t    CHCFG7R1;
    volatile    uint32_t    CHCFG0R2;
    volatile    uint32_t    CHCFG1R2;
    volatile    uint32_t    CHCFG2R2;
    volatile    uint32_t    CHCFG3R2;
    volatile    uint32_t    CHCFG4R2;
    volatile    uint32_t    CHCFG5R2;
    volatile    uint32_t    CHCFG6R2;
    volatile    uint32_t    CHCFG7R2;
    volatile    uint32_t    AWSCD0R;
    volatile    uint32_t    AWSCD1R;
    volatile    uint32_t    AWSCD2R;
    volatile    uint32_t    AWSCD3R;
    volatile    uint32_t    AWSCD4R;
    volatile    uint32_t    AWSCD5R;
    volatile    uint32_t    AWSCD6R;
    volatile    uint32_t    AWSCD7R;
    volatile    uint32_t    CHWDAT0R;
    volatile    uint32_t    CHWDAT1R;
    volatile    uint32_t    CHWDAT2R;
    volatile    uint32_t    CHWDAT3R;
    volatile    uint32_t    CHWDAT4R;
    volatile    uint32_t    CHWDAT5R;
    volatile    uint32_t    CHWDAT6R;
    volatile    uint32_t    CHWDAT7R;
    volatile    uint32_t    CHDATIN0R;
    volatile    uint32_t    CHDATIN1R;
    volatile    uint32_t    CHDATIN2R;
    volatile    uint32_t    CHDATIN3R;
    volatile    uint32_t    CHDATIN4R;
    volatile    uint32_t    CHDATIN5R;
    volatile    uint32_t    CHDATIN6R;
    volatile    uint32_t    CHDATIN7R;
    volatile    uint32_t    DFSDM0_CR1;
    volatile    uint32_t    DFSDM1_CR1;
    volatile    uint32_t    DFSDM2_CR1;
    volatile    uint32_t    DFSDM3_CR1;
    volatile    uint32_t    DFSDM0_CR2;
    volatile    uint32_t    DFSDM1_CR2;
    volatile    uint32_t    DFSDM2_CR2;
    volatile    uint32_t    DFSDM3_CR2;
    volatile    uint32_t    DFSDM0_ISR;
    volatile    uint32_t    DFSDM1_ISR;
    volatile    uint32_t    DFSDM2_ISR;
    volatile    uint32_t    DFSDM3_ISR;
    volatile    uint32_t    DFSDM0_ICR;
    volatile    uint32_t    DFSDM1_ICR;
    volatile    uint32_t    DFSDM2_ICR;
    volatile    uint32_t    DFSDM3_ICR;
    volatile    uint32_t    DFSDM0_JCHGR;
    volatile    uint32_t    DFSDM1_JCHGR;
    volatile    uint32_t    DFSDM2_JCHGR;
    volatile    uint32_t    DFSDM3_JCHGR;
    volatile    uint32_t    DFSDM0_FCR;
    volatile    uint32_t    DFSDM1_FCR;
    volatile    uint32_t    DFSDM2_FCR;
    volatile    uint32_t    DFSDM3_FCR;
    volatile    uint32_t    DFSDM0_JDATAR;
    volatile    uint32_t    DFSDM1_JDATAR;
    volatile    uint32_t    DFSDM2_JDATAR;
    volatile    uint32_t    DFSDM3_JDATAR;
    volatile    uint32_t    DFSDM0_RDATAR;
    volatile    uint32_t    DFSDM1_RDATAR;
    volatile    uint32_t    DFSDM2_RDATAR;
    volatile    uint32_t    DFSDM3_RDATAR;
    volatile    uint32_t    DFSDM0_AWHTR;
    volatile    uint32_t    DFSDM1_AWHTR;
    volatile    uint32_t    DFSDM2_AWHTR;
    volatile    uint32_t    DFSDM3_AWHTR;
    volatile    uint32_t    DFSDM0_AWLTR;
    volatile    uint32_t    DFSDM1_AWLTR;
    volatile    uint32_t    DFSDM2_AWLTR;
    volatile    uint32_t    DFSDM3_AWLTR;
    volatile    uint32_t    DFSDM0_AWSR;
    volatile    uint32_t    DFSDM1_AWSR;
    volatile    uint32_t    DFSDM2_AWSR;
    volatile    uint32_t    DFSDM3_AWSR;
    volatile    uint32_t    DFSDM0_AWCFR;
    volatile    uint32_t    DFSDM1_AWCFR;
    volatile    uint32_t    DFSDM2_AWCFR;
    volatile    uint32_t    DFSDM3_AWCFR;
    volatile    uint32_t    DFSDM0_EXMAX;
    volatile    uint32_t    DFSDM1_EXMAX;
    volatile    uint32_t    DFSDM2_EXMAX;
    volatile    uint32_t    DFSDM3_EXMAX;
    volatile    uint32_t    DFSDM0_EXMIN;
    volatile    uint32_t    DFSDM1_EXMIN;
    volatile    uint32_t    DFSDM2_EXMIN;
    volatile    uint32_t    DFSDM3_EXMIN;
    volatile    uint32_t    DFSDM0_CNVTIMR;
    volatile    uint32_t    DFSDM1_CNVTIMR;
    volatile    uint32_t    DFSDM2_CNVTIMR;
    volatile    uint32_t    DFSDM3_CNVTIMR;
} DFSDM_TypeDef;

#ifdef __cplusplus
#define DFSDM   reinterpret_cast<DFSDM_TypeDef *>(0x40017000U)

#else
#define DFSDM   ((DFSDM_TypeDef *)0x40017000U)
#endif

// CHCFG0R1 Configuration

#define DFSDM_CHCFG0R1_DFSDMEN          (0x1U<<31)
#define DFSDM_CHCFG0R1_CKOUTSRC         (0x1U<<30)
#define DFSDM_CHCFG0R1_CKOUTDIV         (0xFFU<<16)
#define DFSDM_CHCFG0R1_CKOUTDIV_0       (0x1U<<16)
#define DFSDM_CHCFG0R1_DATPACK          (0x3U<<14)
#define DFSDM_CHCFG0R1_DATPACK_0        (0x1U<<14)
#define DFSDM_CHCFG0R1_DATMPX           (0x3U<<12)
#define DFSDM_CHCFG0R1_DATMPX_0         (0x1U<<12)
#define DFSDM_CHCFG0R1_CHINSEL          (0x1U<<8)
#define DFSDM_CHCFG0R1_CHEN             (0x1U<<7)
#define DFSDM_CHCFG0R1_CKABEN           (0x1U<<6)
#define DFSDM_CHCFG0R1_SCDEN            (0x1U<<5)
#define DFSDM_CHCFG0R1_SPICKSEL         (0x3U<<2)
#define DFSDM_CHCFG0R1_SPICKSEL_0       (0x1U<<2)
#define DFSDM_CHCFG0R1_SITP             (0x3U<<0)
#define DFSDM_CHCFG0R1_SITP_0           (0x1U<<0)

// CHCFG1R1 Configuration

#define DFSDM_CHCFG1R1_DFSDMEN          (0x1U<<31)
#define DFSDM_CHCFG1R1_CKOUTSRC         (0x1U<<30)
#define DFSDM_CHCFG1R1_CKOUTDIV         (0xFFU<<16)
#define DFSDM_CHCFG1R1_CKOUTDIV_0       (0x1U<<16)
#define DFSDM_CHCFG1R1_DATPACK          (0x3U<<14)
#define DFSDM_CHCFG1R1_DATPACK_0        (0x1U<<14)
#define DFSDM_CHCFG1R1_DATMPX           (0x3U<<12)
#define DFSDM_CHCFG1R1_DATMPX_0         (0x1U<<12)
#define DFSDM_CHCFG1R1_CHINSEL          (0x1U<<8)
#define DFSDM_CHCFG1R1_CHEN             (0x1U<<7)
#define DFSDM_CHCFG1R1_CKABEN           (0x1U<<6)
#define DFSDM_CHCFG1R1_SCDEN            (0x1U<<5)
#define DFSDM_CHCFG1R1_SPICKSEL         (0x3U<<2)
#define DFSDM_CHCFG1R1_SPICKSEL_0       (0x1U<<2)
#define DFSDM_CHCFG1R1_SITP             (0x3U<<0)
#define DFSDM_CHCFG1R1_SITP_0           (0x1U<<0)

// CHCFG2R1 Configuration

#define DFSDM_CHCFG2R1_DFSDMEN          (0x1U<<31)
#define DFSDM_CHCFG2R1_CKOUTSRC         (0x1U<<30)
#define DFSDM_CHCFG2R1_CKOUTDIV         (0xFFU<<16)
#define DFSDM_CHCFG2R1_CKOUTDIV_0       (0x1U<<16)
#define DFSDM_CHCFG2R1_DATPACK          (0x3U<<14)
#define DFSDM_CHCFG2R1_DATPACK_0        (0x1U<<14)
#define DFSDM_CHCFG2R1_DATMPX           (0x3U<<12)
#define DFSDM_CHCFG2R1_DATMPX_0         (0x1U<<12)
#define DFSDM_CHCFG2R1_CHINSEL          (0x1U<<8)
#define DFSDM_CHCFG2R1_CHEN             (0x1U<<7)
#define DFSDM_CHCFG2R1_CKABEN           (0x1U<<6)
#define DFSDM_CHCFG2R1_SCDEN            (0x1U<<5)
#define DFSDM_CHCFG2R1_SPICKSEL         (0x3U<<2)
#define DFSDM_CHCFG2R1_SPICKSEL_0       (0x1U<<2)
#define DFSDM_CHCFG2R1_SITP             (0x3U<<0)
#define DFSDM_CHCFG2R1_SITP_0           (0x1U<<0)

// CHCFG3R1 Configuration

#define DFSDM_CHCFG3R1_DFSDMEN          (0x1U<<31)
#define DFSDM_CHCFG3R1_CKOUTSRC         (0x1U<<30)
#define DFSDM_CHCFG3R1_CKOUTDIV         (0xFFU<<16)
#define DFSDM_CHCFG3R1_CKOUTDIV_0       (0x1U<<16)
#define DFSDM_CHCFG3R1_DATPACK          (0x3U<<14)
#define DFSDM_CHCFG3R1_DATPACK_0        (0x1U<<14)
#define DFSDM_CHCFG3R1_DATMPX           (0x3U<<12)
#define DFSDM_CHCFG3R1_DATMPX_0         (0x1U<<12)
#define DFSDM_CHCFG3R1_CHINSEL          (0x1U<<8)
#define DFSDM_CHCFG3R1_CHEN             (0x1U<<7)
#define DFSDM_CHCFG3R1_CKABEN           (0x1U<<6)
#define DFSDM_CHCFG3R1_SCDEN            (0x1U<<5)
#define DFSDM_CHCFG3R1_SPICKSEL         (0x3U<<2)
#define DFSDM_CHCFG3R1_SPICKSEL_0       (0x1U<<2)
#define DFSDM_CHCFG3R1_SITP             (0x3U<<0)
#define DFSDM_CHCFG3R1_SITP_0           (0x1U<<0)

// CHCFG4R1 Configuration

#define DFSDM_CHCFG4R1_DFSDMEN          (0x1U<<31)
#define DFSDM_CHCFG4R1_CKOUTSRC         (0x1U<<30)
#define DFSDM_CHCFG4R1_CKOUTDIV         (0xFFU<<16)
#define DFSDM_CHCFG4R1_CKOUTDIV_0       (0x1U<<16)
#define DFSDM_CHCFG4R1_DATPACK          (0x3U<<14)
#define DFSDM_CHCFG4R1_DATPACK_0        (0x1U<<14)
#define DFSDM_CHCFG4R1_DATMPX           (0x3U<<12)
#define DFSDM_CHCFG4R1_DATMPX_0         (0x1U<<12)
#define DFSDM_CHCFG4R1_CHINSEL          (0x1U<<8)
#define DFSDM_CHCFG4R1_CHEN             (0x1U<<7)
#define DFSDM_CHCFG4R1_CKABEN           (0x1U<<6)
#define DFSDM_CHCFG4R1_SCDEN            (0x1U<<5)
#define DFSDM_CHCFG4R1_SPICKSEL         (0x3U<<2)
#define DFSDM_CHCFG4R1_SPICKSEL_0       (0x1U<<2)
#define DFSDM_CHCFG4R1_SITP             (0x3U<<0)
#define DFSDM_CHCFG4R1_SITP_0           (0x1U<<0)

// CHCFG5R1 Configuration

