Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_dfsdm.h
#define DFSDM_CHCFG5R1_DFSDMEN          (0x1U<<31)
#define DFSDM_CHCFG5R1_CKOUTSRC         (0x1U<<30)
#define DFSDM_CHCFG5R1_CKOUTDIV         (0xFFU<<16)
#define DFSDM_CHCFG5R1_CKOUTDIV_0       (0x1U<<16)
#define DFSDM_CHCFG5R1_DATPACK          (0x3U<<14)
#define DFSDM_CHCFG5R1_DATPACK_0        (0x1U<<14)
#define DFSDM_CHCFG5R1_DATMPX           (0x3U<<12)
#define DFSDM_CHCFG5R1_DATMPX_0         (0x1U<<12)
#define DFSDM_CHCFG5R1_CHINSEL          (0x1U<<8)
#define DFSDM_CHCFG5R1_CHEN             (0x1U<<7)
#define DFSDM_CHCFG5R1_CKABEN           (0x1U<<6)
#define DFSDM_CHCFG5R1_SCDEN            (0x1U<<5)
#define DFSDM_CHCFG5R1_SPICKSEL         (0x3U<<2)
#define DFSDM_CHCFG5R1_SPICKSEL_0       (0x1U<<2)
#define DFSDM_CHCFG5R1_SITP             (0x3U<<0)
#define DFSDM_CHCFG5R1_SITP_0           (0x1U<<0)

// CHCFG6R1 Configuration

#define DFSDM_CHCFG6R1_DFSDMEN          (0x1U<<31)
#define DFSDM_CHCFG6R1_CKOUTSRC         (0x1U<<30)
#define DFSDM_CHCFG6R1_CKOUTDIV         (0xFFU<<16)
#define DFSDM_CHCFG6R1_CKOUTDIV_0       (0x1U<<16)
#define DFSDM_CHCFG6R1_DATPACK          (0x3U<<14)
#define DFSDM_CHCFG6R1_DATPACK_0        (0x1U<<14)
#define DFSDM_CHCFG6R1_DATMPX           (0x3U<<12)
#define DFSDM_CHCFG6R1_DATMPX_0         (0x1U<<12)
#define DFSDM_CHCFG6R1_CHINSEL          (0x1U<<8)
#define DFSDM_CHCFG6R1_CHEN             (0x1U<<7)
#define DFSDM_CHCFG6R1_CKABEN           (0x1U<<6)
#define DFSDM_CHCFG6R1_SCDEN            (0x1U<<5)
#define DFSDM_CHCFG6R1_SPICKSEL         (0x3U<<2)
#define DFSDM_CHCFG6R1_SPICKSEL_0       (0x1U<<2)
#define DFSDM_CHCFG6R1_SITP             (0x3U<<0)
#define DFSDM_CHCFG6R1_SITP_0           (0x1U<<0)

// CHCFG7R1 Configuration

#define DFSDM_CHCFG7R1_DFSDMEN          (0x1U<<31)
#define DFSDM_CHCFG7R1_CKOUTSRC         (0x1U<<30)
#define DFSDM_CHCFG7R1_CKOUTDIV         (0xFFU<<16)
#define DFSDM_CHCFG7R1_CKOUTDIV_0       (0x1U<<16)
#define DFSDM_CHCFG7R1_DATPACK          (0x3U<<14)
#define DFSDM_CHCFG7R1_DATPACK_0        (0x1U<<14)
#define DFSDM_CHCFG7R1_DATMPX           (0x3U<<12)
#define DFSDM_CHCFG7R1_DATMPX_0         (0x1U<<12)
#define DFSDM_CHCFG7R1_CHINSEL          (0x1U<<8)
#define DFSDM_CHCFG7R1_CHEN             (0x1U<<7)
#define DFSDM_CHCFG7R1_CKABEN           (0x1U<<6)
#define DFSDM_CHCFG7R1_SCDEN            (0x1U<<5)
#define DFSDM_CHCFG7R1_SPICKSEL         (0x3U<<2)
#define DFSDM_CHCFG7R1_SPICKSEL_0       (0x1U<<2)
#define DFSDM_CHCFG7R1_SITP             (0x3U<<0)
#define DFSDM_CHCFG7R1_SITP_0           (0x1U<<0)

// CHCFG0R2 Configuration

#define DFSDM_CHCFG0R2_OFFSET           (0xFFFFFFU<<8)
#define DFSDM_CHCFG0R2_OFFSET_0         (0x1U<<8)
#define DFSDM_CHCFG0R2_DTRBS            (0x1FU<<3)
#define DFSDM_CHCFG0R2_DTRBS_0          (0x1U<<3)

// CHCFG1R2 Configuration

#define DFSDM_CHCFG1R2_OFFSET           (0xFFFFFFU<<8)
#define DFSDM_CHCFG1R2_OFFSET_0         (0x1U<<8)
#define DFSDM_CHCFG1R2_DTRBS            (0x1FU<<3)
#define DFSDM_CHCFG1R2_DTRBS_0          (0x1U<<3)

// CHCFG2R2 Configuration

#define DFSDM_CHCFG2R2_OFFSET           (0xFFFFFFU<<8)
#define DFSDM_CHCFG2R2_OFFSET_0         (0x1U<<8)
#define DFSDM_CHCFG2R2_DTRBS            (0x1FU<<3)
#define DFSDM_CHCFG2R2_DTRBS_0          (0x1U<<3)

// CHCFG3R2 Configuration

#define DFSDM_CHCFG3R2_OFFSET           (0xFFFFFFU<<8)
#define DFSDM_CHCFG3R2_OFFSET_0         (0x1U<<8)
#define DFSDM_CHCFG3R2_DTRBS            (0x1FU<<3)
#define DFSDM_CHCFG3R2_DTRBS_0          (0x1U<<3)

// CHCFG4R2 Configuration

#define DFSDM_CHCFG4R2_OFFSET           (0xFFFFFFU<<8)
#define DFSDM_CHCFG4R2_OFFSET_0         (0x1U<<8)
#define DFSDM_CHCFG4R2_DTRBS            (0x1FU<<3)
#define DFSDM_CHCFG4R2_DTRBS_0          (0x1U<<3)

// CHCFG5R2 Configuration

#define DFSDM_CHCFG5R2_OFFSET           (0xFFFFFFU<<8)
#define DFSDM_CHCFG5R2_OFFSET_0         (0x1U<<8)
#define DFSDM_CHCFG5R2_DTRBS            (0x1FU<<3)
#define DFSDM_CHCFG5R2_DTRBS_0          (0x1U<<3)

// CHCFG6R2 Configuration

#define DFSDM_CHCFG6R2_OFFSET           (0xFFFFFFU<<8)
#define DFSDM_CHCFG6R2_OFFSET_0         (0x1U<<8)
#define DFSDM_CHCFG6R2_DTRBS            (0x1FU<<3)
#define DFSDM_CHCFG6R2_DTRBS_0          (0x1U<<3)

// CHCFG7R2 Configuration

#define DFSDM_CHCFG7R2_OFFSET           (0xFFFFFFU<<8)
#define DFSDM_CHCFG7R2_OFFSET_0         (0x1U<<8)
#define DFSDM_CHCFG7R2_DTRBS            (0x1FU<<3)
#define DFSDM_CHCFG7R2_DTRBS_0          (0x1U<<3)

// AWSCD0R Configuration

#define DFSDM_AWSCD0R_AWFORD            (0x3U<<22)
#define DFSDM_AWSCD0R_AWFORD_0          (0x1U<<22)
#define DFSDM_AWSCD0R_AWFOSR            (0x1FU<<16)
#define DFSDM_AWSCD0R_AWFOSR_0          (0x1U<<16)
#define DFSDM_AWSCD0R_BKSCD             (0xFU<<12)
#define DFSDM_AWSCD0R_BKSCD_0           (0x1U<<12)
#define DFSDM_AWSCD0R_SCDT              (0xFFU<<0)
#define DFSDM_AWSCD0R_SCDT_0            (0x1U<<0)

// AWSCD1R Configuration

#define DFSDM_AWSCD1R_AWFORD            (0x3U<<22)
#define DFSDM_AWSCD1R_AWFORD_0          (0x1U<<22)
#define DFSDM_AWSCD1R_AWFOSR            (0x1FU<<16)
#define DFSDM_AWSCD1R_AWFOSR_0          (0x1U<<16)
#define DFSDM_AWSCD1R_BKSCD             (0xFU<<12)
#define DFSDM_AWSCD1R_BKSCD_0           (0x1U<<12)
#define DFSDM_AWSCD1R_SCDT              (0xFFU<<0)
#define DFSDM_AWSCD1R_SCDT_0            (0x1U<<0)

// AWSCD2R Configuration

#define DFSDM_AWSCD2R_AWFORD            (0x3U<<22)
#define DFSDM_AWSCD2R_AWFORD_0          (0x1U<<22)
#define DFSDM_AWSCD2R_AWFOSR            (0x1FU<<16)
#define DFSDM_AWSCD2R_AWFOSR_0          (0x1U<<16)
#define DFSDM_AWSCD2R_BKSCD             (0xFU<<12)
#define DFSDM_AWSCD2R_BKSCD_0           (0x1U<<12)
#define DFSDM_AWSCD2R_SCDT              (0xFFU<<0)
#define DFSDM_AWSCD2R_SCDT_0            (0x1U<<0)

// AWSCD3R Configuration

#define DFSDM_AWSCD3R_AWFORD            (0x3U<<22)
#define DFSDM_AWSCD3R_AWFORD_0          (0x1U<<22)
#define DFSDM_AWSCD3R_AWFOSR            (0x1FU<<16)
#define DFSDM_AWSCD3R_AWFOSR_0          (0x1U<<16)
#define DFSDM_AWSCD3R_BKSCD             (0xFU<<12)
#define DFSDM_AWSCD3R_BKSCD_0           (0x1U<<12)
#define DFSDM_AWSCD3R_SCDT              (0xFFU<<0)
#define DFSDM_AWSCD3R_SCDT_0            (0x1U<<0)

// AWSCD4R Configuration

#define DFSDM_AWSCD4R_AWFORD            (0x3U<<22)
#define DFSDM_AWSCD4R_AWFORD_0          (0x1U<<22)
#define DFSDM_AWSCD4R_AWFOSR            (0x1FU<<16)
#define DFSDM_AWSCD4R_AWFOSR_0          (0x1U<<16)
#define DFSDM_AWSCD4R_BKSCD             (0xFU<<12)
#define DFSDM_AWSCD4R_BKSCD_0           (0x1U<<12)
#define DFSDM_AWSCD4R_SCDT              (0xFFU<<0)
#define DFSDM_AWSCD4R_SCDT_0            (0x1U<<0)

// AWSCD5R Configuration

#define DFSDM_AWSCD5R_AWFORD            (0x3U<<22)
#define DFSDM_AWSCD5R_AWFORD_0          (0x1U<<22)
#define DFSDM_AWSCD5R_AWFOSR            (0x1FU<<16)
#define DFSDM_AWSCD5R_AWFOSR_0          (0x1U<<16)
#define DFSDM_AWSCD5R_BKSCD             (0xFU<<12)
#define DFSDM_AWSCD5R_BKSCD_0           (0x1U<<12)
#define DFSDM_AWSCD5R_SCDT              (0xFFU<<0)
#define DFSDM_AWSCD5R_SCDT_0            (0x1U<<0)

// AWSCD6R Configuration

