Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_dfsdm.h
#define DFSDM_AWSCD6R_AWFORD            (0x3U<<22)
#define DFSDM_AWSCD6R_AWFORD_0          (0x1U<<22)
#define DFSDM_AWSCD6R_AWFOSR            (0x1FU<<16)
#define DFSDM_AWSCD6R_AWFOSR_0          (0x1U<<16)
#define DFSDM_AWSCD6R_BKSCD             (0xFU<<12)
#define DFSDM_AWSCD6R_BKSCD_0           (0x1U<<12)
#define DFSDM_AWSCD6R_SCDT              (0xFFU<<0)
#define DFSDM_AWSCD6R_SCDT_0            (0x1U<<0)

// AWSCD7R Configuration

#define DFSDM_AWSCD7R_AWFORD            (0x3U<<22)
#define DFSDM_AWSCD7R_AWFORD_0          (0x1U<<22)
#define DFSDM_AWSCD7R_AWFOSR            (0x1FU<<16)
#define DFSDM_AWSCD7R_AWFOSR_0          (0x1U<<16)
#define DFSDM_AWSCD7R_BKSCD             (0xFU<<12)
#define DFSDM_AWSCD7R_BKSCD_0           (0x1U<<12)
#define DFSDM_AWSCD7R_SCDT              (0xFFU<<0)
#define DFSDM_AWSCD7R_SCDT_0            (0x1U<<0)

// CHWDAT0R Configuration

#define DFSDM_CHWDAT0R_WDATA            (0xFFFFU<<0)
#define DFSDM_CHWDAT0R_WDATA_0          (0x1U<<0)

// CHWDAT1R Configuration

#define DFSDM_CHWDAT1R_WDATA            (0xFFFFU<<0)
#define DFSDM_CHWDAT1R_WDATA_0          (0x1U<<0)

// CHWDAT2R Configuration

#define DFSDM_CHWDAT2R_WDATA            (0xFFFFU<<0)
#define DFSDM_CHWDAT2R_WDATA_0          (0x1U<<0)

// CHWDAT3R Configuration

#define DFSDM_CHWDAT3R_WDATA            (0xFFFFU<<0)
#define DFSDM_CHWDAT3R_WDATA_0          (0x1U<<0)

// CHWDAT4R Configuration

#define DFSDM_CHWDAT4R_WDATA            (0xFFFFU<<0)
#define DFSDM_CHWDAT4R_WDATA_0          (0x1U<<0)

// CHWDAT5R Configuration

#define DFSDM_CHWDAT5R_WDATA            (0xFFFFU<<0)
#define DFSDM_CHWDAT5R_WDATA_0          (0x1U<<0)

// CHWDAT6R Configuration

#define DFSDM_CHWDAT6R_WDATA            (0xFFFFU<<0)
#define DFSDM_CHWDAT6R_WDATA_0          (0x1U<<0)

// CHWDAT7R Configuration

#define DFSDM_CHWDAT7R_WDATA            (0xFFFFU<<0)
#define DFSDM_CHWDAT7R_WDATA_0          (0x1U<<0)

// CHDATIN0R Configuration

#define DFSDM_CHDATIN0R_INDAT1          (0xFFFFU<<16)
#define DFSDM_CHDATIN0R_INDAT1_0        (0x1U<<16)
#define DFSDM_CHDATIN0R_INDAT0          (0xFFFFU<<0)
#define DFSDM_CHDATIN0R_INDAT0_0        (0x1U<<0)

// CHDATIN1R Configuration

#define DFSDM_CHDATIN1R_INDAT1          (0xFFFFU<<16)
#define DFSDM_CHDATIN1R_INDAT1_0        (0x1U<<16)
#define DFSDM_CHDATIN1R_INDAT0          (0xFFFFU<<0)
#define DFSDM_CHDATIN1R_INDAT0_0        (0x1U<<0)

// CHDATIN2R Configuration

#define DFSDM_CHDATIN2R_INDAT1          (0xFFFFU<<16)
#define DFSDM_CHDATIN2R_INDAT1_0        (0x1U<<16)
#define DFSDM_CHDATIN2R_INDAT0          (0xFFFFU<<0)
#define DFSDM_CHDATIN2R_INDAT0_0        (0x1U<<0)

// CHDATIN3R Configuration

#define DFSDM_CHDATIN3R_INDAT1          (0xFFFFU<<16)
#define DFSDM_CHDATIN3R_INDAT1_0        (0x1U<<16)
#define DFSDM_CHDATIN3R_INDAT0          (0xFFFFU<<0)
#define DFSDM_CHDATIN3R_INDAT0_0        (0x1U<<0)

// CHDATIN4R Configuration

#define DFSDM_CHDATIN4R_INDAT1          (0xFFFFU<<16)
#define DFSDM_CHDATIN4R_INDAT1_0        (0x1U<<16)
#define DFSDM_CHDATIN4R_INDAT0          (0xFFFFU<<0)
#define DFSDM_CHDATIN4R_INDAT0_0        (0x1U<<0)

// CHDATIN5R Configuration

#define DFSDM_CHDATIN5R_INDAT1          (0xFFFFU<<16)
#define DFSDM_CHDATIN5R_INDAT1_0        (0x1U<<16)
#define DFSDM_CHDATIN5R_INDAT0          (0xFFFFU<<0)
#define DFSDM_CHDATIN5R_INDAT0_0        (0x1U<<0)

// CHDATIN6R Configuration

#define DFSDM_CHDATIN6R_INDAT1          (0xFFFFU<<16)
#define DFSDM_CHDATIN6R_INDAT1_0        (0x1U<<16)
#define DFSDM_CHDATIN6R_INDAT0          (0xFFFFU<<0)
#define DFSDM_CHDATIN6R_INDAT0_0        (0x1U<<0)

// CHDATIN7R Configuration

#define DFSDM_CHDATIN7R_INDAT1          (0xFFFFU<<16)
#define DFSDM_CHDATIN7R_INDAT1_0        (0x1U<<16)
#define DFSDM_CHDATIN7R_INDAT0          (0xFFFFU<<0)
#define DFSDM_CHDATIN7R_INDAT0_0        (0x1U<<0)

// DFSDM0_CR1 Configuration

#define DFSDM_DFSDM0_CR1_AWFSEL         (0x1U<<30)
#define DFSDM_DFSDM0_CR1_FAST           (0x1U<<29)
#define DFSDM_DFSDM0_CR1_RCH            (0x7U<<24)
#define DFSDM_DFSDM0_CR1_RCH_0          (0x1U<<24)
#define DFSDM_DFSDM0_CR1_RDMAEN         (0x1U<<21)
#define DFSDM_DFSDM0_CR1_RSYNC          (0x1U<<19)
#define DFSDM_DFSDM0_CR1_RCONT          (0x1U<<18)
#define DFSDM_DFSDM0_CR1_RSWSTART       (0x1U<<17)
#define DFSDM_DFSDM0_CR1_JEXTEN         (0x3U<<13)
#define DFSDM_DFSDM0_CR1_JEXTEN_0       (0x1U<<13)
#define DFSDM_DFSDM0_CR1_JEXTSEL        (0x1FU<<8)
#define DFSDM_DFSDM0_CR1_JEXTSEL_0      (0x1U<<8)
#define DFSDM_DFSDM0_CR1_JDMAEN         (0x1U<<5)
#define DFSDM_DFSDM0_CR1_JSCAN          (0x1U<<4)
#define DFSDM_DFSDM0_CR1_JSYNC          (0x1U<<3)
#define DFSDM_DFSDM0_CR1_JSWSTART       (0x1U<<1)
#define DFSDM_DFSDM0_CR1_DFEN           (0x1U<<0)

// DFSDM1_CR1 Configuration

#define DFSDM_DFSDM1_CR1_AWFSEL         (0x1U<<30)
#define DFSDM_DFSDM1_CR1_FAST           (0x1U<<29)
#define DFSDM_DFSDM1_CR1_RCH            (0x7U<<24)
#define DFSDM_DFSDM1_CR1_RCH_0          (0x1U<<24)
#define DFSDM_DFSDM1_CR1_RDMAEN         (0x1U<<21)
#define DFSDM_DFSDM1_CR1_RSYNC          (0x1U<<19)
#define DFSDM_DFSDM1_CR1_RCONT          (0x1U<<18)
#define DFSDM_DFSDM1_CR1_RSWSTART       (0x1U<<17)
#define DFSDM_DFSDM1_CR1_JEXTEN         (0x3U<<13)
#define DFSDM_DFSDM1_CR1_JEXTEN_0       (0x1U<<13)
#define DFSDM_DFSDM1_CR1_JEXTSEL        (0x1FU<<8)
#define DFSDM_DFSDM1_CR1_JEXTSEL_0      (0x1U<<8)
#define DFSDM_DFSDM1_CR1_JDMAEN         (0x1U<<5)
#define DFSDM_DFSDM1_CR1_JSCAN          (0x1U<<4)
#define DFSDM_DFSDM1_CR1_JSYNC          (0x1U<<3)
#define DFSDM_DFSDM1_CR1_JSWSTART       (0x1U<<1)
#define DFSDM_DFSDM1_CR1_DFEN           (0x1U<<0)

// DFSDM2_CR1 Configuration

#define DFSDM_DFSDM2_CR1_AWFSEL         (0x1U<<30)
#define DFSDM_DFSDM2_CR1_FAST           (0x1U<<29)
#define DFSDM_DFSDM2_CR1_RCH            (0x7U<<24)
#define DFSDM_DFSDM2_CR1_RCH_0          (0x1U<<24)
#define DFSDM_DFSDM2_CR1_RDMAEN         (0x1U<<21)
#define DFSDM_DFSDM2_CR1_RSYNC          (0x1U<<19)
#define DFSDM_DFSDM2_CR1_RCONT          (0x1U<<18)
#define DFSDM_DFSDM2_CR1_RSWSTART       (0x1U<<17)
#define DFSDM_DFSDM2_CR1_JEXTEN         (0x3U<<13)
#define DFSDM_DFSDM2_CR1_JEXTEN_0       (0x1U<<13)
#define DFSDM_DFSDM2_CR1_JEXTSEL        (0x1FU<<8)
#define DFSDM_DFSDM2_CR1_JEXTSEL_0      (0x1U<<8)
#define DFSDM_DFSDM2_CR1_JDMAEN         (0x1U<<5)
#define DFSDM_DFSDM2_CR1_JSCAN          (0x1U<<4)
#define DFSDM_DFSDM2_CR1_JSYNC          (0x1U<<3)
#define DFSDM_DFSDM2_CR1_JSWSTART       (0x1U<<1)
#define DFSDM_DFSDM2_CR1_DFEN           (0x1U<<0)

