Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_dfsdm.h
// DFSDM3_CR1 Configuration

#define DFSDM_DFSDM3_CR1_AWFSEL         (0x1U<<30)
#define DFSDM_DFSDM3_CR1_FAST           (0x1U<<29)
#define DFSDM_DFSDM3_CR1_RCH            (0x7U<<24)
#define DFSDM_DFSDM3_CR1_RCH_0          (0x1U<<24)
#define DFSDM_DFSDM3_CR1_RDMAEN         (0x1U<<21)
#define DFSDM_DFSDM3_CR1_RSYNC          (0x1U<<19)
#define DFSDM_DFSDM3_CR1_RCONT          (0x1U<<18)
#define DFSDM_DFSDM3_CR1_RSWSTART       (0x1U<<17)
#define DFSDM_DFSDM3_CR1_JEXTEN         (0x3U<<13)
#define DFSDM_DFSDM3_CR1_JEXTEN_0       (0x1U<<13)
#define DFSDM_DFSDM3_CR1_JEXTSEL        (0x1FU<<8)
#define DFSDM_DFSDM3_CR1_JEXTSEL_0      (0x1U<<8)
#define DFSDM_DFSDM3_CR1_JDMAEN         (0x1U<<5)
#define DFSDM_DFSDM3_CR1_JSCAN          (0x1U<<4)
#define DFSDM_DFSDM3_CR1_JSYNC          (0x1U<<3)
#define DFSDM_DFSDM3_CR1_JSWSTART       (0x1U<<1)
#define DFSDM_DFSDM3_CR1_DFEN           (0x1U<<0)

// DFSDM0_CR2 Configuration

#define DFSDM_DFSDM0_CR2_AWDCH          (0xFFU<<16)
#define DFSDM_DFSDM0_CR2_AWDCH_0        (0x1U<<16)
#define DFSDM_DFSDM0_CR2_EXCH           (0xFFU<<8)
#define DFSDM_DFSDM0_CR2_EXCH_0         (0x1U<<8)
#define DFSDM_DFSDM0_CR2_CKABIE         (0x1U<<6)
#define DFSDM_DFSDM0_CR2_SCDIE          (0x1U<<5)
#define DFSDM_DFSDM0_CR2_AWDIE          (0x1U<<4)
#define DFSDM_DFSDM0_CR2_ROVRIE         (0x1U<<3)
#define DFSDM_DFSDM0_CR2_JOVRIE         (0x1U<<2)
#define DFSDM_DFSDM0_CR2_REOCIE         (0x1U<<1)
#define DFSDM_DFSDM0_CR2_JEOCIE         (0x1U<<0)

// DFSDM1_CR2 Configuration

#define DFSDM_DFSDM1_CR2_AWDCH          (0xFFU<<16)
#define DFSDM_DFSDM1_CR2_AWDCH_0        (0x1U<<16)
#define DFSDM_DFSDM1_CR2_EXCH           (0xFFU<<8)
#define DFSDM_DFSDM1_CR2_EXCH_0         (0x1U<<8)
#define DFSDM_DFSDM1_CR2_CKABIE         (0x1U<<6)
#define DFSDM_DFSDM1_CR2_SCDIE          (0x1U<<5)
#define DFSDM_DFSDM1_CR2_AWDIE          (0x1U<<4)
#define DFSDM_DFSDM1_CR2_ROVRIE         (0x1U<<3)
#define DFSDM_DFSDM1_CR2_JOVRIE         (0x1U<<2)
#define DFSDM_DFSDM1_CR2_REOCIE         (0x1U<<1)
#define DFSDM_DFSDM1_CR2_JEOCIE         (0x1U<<0)

// DFSDM2_CR2 Configuration

#define DFSDM_DFSDM2_CR2_AWDCH          (0xFFU<<16)
#define DFSDM_DFSDM2_CR2_AWDCH_0        (0x1U<<16)
#define DFSDM_DFSDM2_CR2_EXCH           (0xFFU<<8)
#define DFSDM_DFSDM2_CR2_EXCH_0         (0x1U<<8)
#define DFSDM_DFSDM2_CR2_CKABIE         (0x1U<<6)
#define DFSDM_DFSDM2_CR2_SCDIE          (0x1U<<5)
#define DFSDM_DFSDM2_CR2_AWDIE          (0x1U<<4)
#define DFSDM_DFSDM2_CR2_ROVRIE         (0x1U<<3)
#define DFSDM_DFSDM2_CR2_JOVRIE         (0x1U<<2)
#define DFSDM_DFSDM2_CR2_REOCIE         (0x1U<<1)
#define DFSDM_DFSDM2_CR2_JEOCIE         (0x1U<<0)

// DFSDM3_CR2 Configuration

#define DFSDM_DFSDM3_CR2_AWDCH          (0xFFU<<16)
#define DFSDM_DFSDM3_CR2_AWDCH_0        (0x1U<<16)
#define DFSDM_DFSDM3_CR2_EXCH           (0xFFU<<8)
#define DFSDM_DFSDM3_CR2_EXCH_0         (0x1U<<8)
#define DFSDM_DFSDM3_CR2_CKABIE         (0x1U<<6)
#define DFSDM_DFSDM3_CR2_SCDIE          (0x1U<<5)
#define DFSDM_DFSDM3_CR2_AWDIE          (0x1U<<4)
#define DFSDM_DFSDM3_CR2_ROVRIE         (0x1U<<3)
#define DFSDM_DFSDM3_CR2_JOVRIE         (0x1U<<2)
#define DFSDM_DFSDM3_CR2_REOCIE         (0x1U<<1)
#define DFSDM_DFSDM3_CR2_JEOCIE         (0x1U<<0)

// DFSDM0_ISR Configuration

#define DFSDM_DFSDM0_ISR_SCDF           (0xFFU<<24)
#define DFSDM_DFSDM0_ISR_SCDF_0         (0x1U<<24)
#define DFSDM_DFSDM0_ISR_CKABF          (0xFFU<<16)
#define DFSDM_DFSDM0_ISR_CKABF_0        (0x1U<<16)
#define DFSDM_DFSDM0_ISR_RCIP           (0x1U<<14)
#define DFSDM_DFSDM0_ISR_JCIP           (0x1U<<13)
#define DFSDM_DFSDM0_ISR_AWDF           (0x1U<<4)
#define DFSDM_DFSDM0_ISR_ROVRF          (0x1U<<3)
#define DFSDM_DFSDM0_ISR_JOVRF          (0x1U<<2)
#define DFSDM_DFSDM0_ISR_REOCF          (0x1U<<1)
#define DFSDM_DFSDM0_ISR_JEOCF          (0x1U<<0)

// DFSDM1_ISR Configuration

#define DFSDM_DFSDM1_ISR_SCDF           (0xFFU<<24)
#define DFSDM_DFSDM1_ISR_SCDF_0         (0x1U<<24)
#define DFSDM_DFSDM1_ISR_CKABF          (0xFFU<<16)
#define DFSDM_DFSDM1_ISR_CKABF_0        (0x1U<<16)
#define DFSDM_DFSDM1_ISR_RCIP           (0x1U<<14)
#define DFSDM_DFSDM1_ISR_JCIP           (0x1U<<13)
#define DFSDM_DFSDM1_ISR_AWDF           (0x1U<<4)
#define DFSDM_DFSDM1_ISR_ROVRF          (0x1U<<3)
#define DFSDM_DFSDM1_ISR_JOVRF          (0x1U<<2)
#define DFSDM_DFSDM1_ISR_REOCF          (0x1U<<1)
#define DFSDM_DFSDM1_ISR_JEOCF          (0x1U<<0)

// DFSDM2_ISR Configuration

#define DFSDM_DFSDM2_ISR_SCDF           (0xFFU<<24)
#define DFSDM_DFSDM2_ISR_SCDF_0         (0x1U<<24)
#define DFSDM_DFSDM2_ISR_CKABF          (0xFFU<<16)
#define DFSDM_DFSDM2_ISR_CKABF_0        (0x1U<<16)
#define DFSDM_DFSDM2_ISR_RCIP           (0x1U<<14)
#define DFSDM_DFSDM2_ISR_JCIP           (0x1U<<13)
#define DFSDM_DFSDM2_ISR_AWDF           (0x1U<<4)
#define DFSDM_DFSDM2_ISR_ROVRF          (0x1U<<3)
#define DFSDM_DFSDM2_ISR_JOVRF          (0x1U<<2)
#define DFSDM_DFSDM2_ISR_REOCF          (0x1U<<1)
#define DFSDM_DFSDM2_ISR_JEOCF          (0x1U<<0)

// DFSDM3_ISR Configuration

#define DFSDM_DFSDM3_ISR_SCDF           (0xFFU<<24)
#define DFSDM_DFSDM3_ISR_SCDF_0         (0x1U<<24)
#define DFSDM_DFSDM3_ISR_CKABF          (0xFFU<<16)
#define DFSDM_DFSDM3_ISR_CKABF_0        (0x1U<<16)
#define DFSDM_DFSDM3_ISR_RCIP           (0x1U<<14)
#define DFSDM_DFSDM3_ISR_JCIP           (0x1U<<13)
#define DFSDM_DFSDM3_ISR_AWDF           (0x1U<<4)
#define DFSDM_DFSDM3_ISR_ROVRF          (0x1U<<3)
#define DFSDM_DFSDM3_ISR_JOVRF          (0x1U<<2)
#define DFSDM_DFSDM3_ISR_REOCF          (0x1U<<1)
#define DFSDM_DFSDM3_ISR_JEOCF          (0x1U<<0)

// DFSDM0_ICR Configuration

#define DFSDM_DFSDM0_ICR_CLRSCDF        (0xFFU<<24)
#define DFSDM_DFSDM0_ICR_CLRSCDF_0      (0x1U<<24)
#define DFSDM_DFSDM0_ICR_CLRCKABF       (0xFFU<<16)
#define DFSDM_DFSDM0_ICR_CLRCKABF_0     (0x1U<<16)
#define DFSDM_DFSDM0_ICR_CLRROVRF       (0x1U<<3)
#define DFSDM_DFSDM0_ICR_CLRJOVRF       (0x1U<<2)

// DFSDM1_ICR Configuration

#define DFSDM_DFSDM1_ICR_CLRSCDF        (0xFFU<<24)
#define DFSDM_DFSDM1_ICR_CLRSCDF_0      (0x1U<<24)
#define DFSDM_DFSDM1_ICR_CLRCKABF       (0xFFU<<16)
#define DFSDM_DFSDM1_ICR_CLRCKABF_0     (0x1U<<16)
#define DFSDM_DFSDM1_ICR_CLRROVRF       (0x1U<<3)
#define DFSDM_DFSDM1_ICR_CLRJOVRF       (0x1U<<2)

