Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_dfsdm.h
// DFSDM2_ICR Configuration

#define DFSDM_DFSDM2_ICR_CLRSCDF        (0xFFU<<24)
#define DFSDM_DFSDM2_ICR_CLRSCDF_0      (0x1U<<24)
#define DFSDM_DFSDM2_ICR_CLRCKABF       (0xFFU<<16)
#define DFSDM_DFSDM2_ICR_CLRCKABF_0     (0x1U<<16)
#define DFSDM_DFSDM2_ICR_CLRROVRF       (0x1U<<3)
#define DFSDM_DFSDM2_ICR_CLRJOVRF       (0x1U<<2)

// DFSDM3_ICR Configuration

#define DFSDM_DFSDM3_ICR_CLRSCDF        (0xFFU<<24)
#define DFSDM_DFSDM3_ICR_CLRSCDF_0      (0x1U<<24)
#define DFSDM_DFSDM3_ICR_CLRCKABF       (0xFFU<<16)
#define DFSDM_DFSDM3_ICR_CLRCKABF_0     (0x1U<<16)
#define DFSDM_DFSDM3_ICR_CLRROVRF       (0x1U<<3)
#define DFSDM_DFSDM3_ICR_CLRJOVRF       (0x1U<<2)

// DFSDM0_JCHGR Configuration

#define DFSDM_DFSDM0_JCHGR_JCHG         (0xFFU<<0)
#define DFSDM_DFSDM0_JCHGR_JCHG_0       (0x1U<<0)

// DFSDM1_JCHGR Configuration

#define DFSDM_DFSDM1_JCHGR_JCHG         (0xFFU<<0)
#define DFSDM_DFSDM1_JCHGR_JCHG_0       (0x1U<<0)

// DFSDM2_JCHGR Configuration

#define DFSDM_DFSDM2_JCHGR_JCHG         (0xFFU<<0)
#define DFSDM_DFSDM2_JCHGR_JCHG_0       (0x1U<<0)

// DFSDM3_JCHGR Configuration

#define DFSDM_DFSDM3_JCHGR_JCHG         (0xFFU<<0)
#define DFSDM_DFSDM3_JCHGR_JCHG_0       (0x1U<<0)

// DFSDM0_FCR Configuration

#define DFSDM_DFSDM0_FCR_FORD           (0x7U<<29)
#define DFSDM_DFSDM0_FCR_FORD_0         (0x1U<<29)
#define DFSDM_DFSDM0_FCR_FOSR           (0x3FFU<<16)
#define DFSDM_DFSDM0_FCR_FOSR_0         (0x1U<<16)
#define DFSDM_DFSDM0_FCR_IOSR           (0xFFU<<0)
#define DFSDM_DFSDM0_FCR_IOSR_0         (0x1U<<0)

// DFSDM1_FCR Configuration

#define DFSDM_DFSDM1_FCR_FORD           (0x7U<<29)
#define DFSDM_DFSDM1_FCR_FORD_0         (0x1U<<29)
#define DFSDM_DFSDM1_FCR_FOSR           (0x3FFU<<16)
#define DFSDM_DFSDM1_FCR_FOSR_0         (0x1U<<16)
#define DFSDM_DFSDM1_FCR_IOSR           (0xFFU<<0)
#define DFSDM_DFSDM1_FCR_IOSR_0         (0x1U<<0)

// DFSDM2_FCR Configuration

#define DFSDM_DFSDM2_FCR_FORD           (0x7U<<29)
#define DFSDM_DFSDM2_FCR_FORD_0         (0x1U<<29)
#define DFSDM_DFSDM2_FCR_FOSR           (0x3FFU<<16)
#define DFSDM_DFSDM2_FCR_FOSR_0         (0x1U<<16)
#define DFSDM_DFSDM2_FCR_IOSR           (0xFFU<<0)
#define DFSDM_DFSDM2_FCR_IOSR_0         (0x1U<<0)

// DFSDM3_FCR Configuration

#define DFSDM_DFSDM3_FCR_FORD           (0x7U<<29)
#define DFSDM_DFSDM3_FCR_FORD_0         (0x1U<<29)
#define DFSDM_DFSDM3_FCR_FOSR           (0x3FFU<<16)
#define DFSDM_DFSDM3_FCR_FOSR_0         (0x1U<<16)
#define DFSDM_DFSDM3_FCR_IOSR           (0xFFU<<0)
#define DFSDM_DFSDM3_FCR_IOSR_0         (0x1U<<0)

// DFSDM0_JDATAR Configuration

#define DFSDM_DFSDM0_JDATAR_JDATA       (0xFFFFFFU<<8)
#define DFSDM_DFSDM0_JDATAR_JDATA_0     (0x1U<<8)
#define DFSDM_DFSDM0_JDATAR_JDATACH     (0x7U<<0)
#define DFSDM_DFSDM0_JDATAR_JDATACH_0   (0x1U<<0)

// DFSDM1_JDATAR Configuration

#define DFSDM_DFSDM1_JDATAR_JDATA       (0xFFFFFFU<<8)
#define DFSDM_DFSDM1_JDATAR_JDATA_0     (0x1U<<8)
#define DFSDM_DFSDM1_JDATAR_JDATACH     (0x7U<<0)
#define DFSDM_DFSDM1_JDATAR_JDATACH_0   (0x1U<<0)

// DFSDM2_JDATAR Configuration

#define DFSDM_DFSDM2_JDATAR_JDATA       (0xFFFFFFU<<8)
#define DFSDM_DFSDM2_JDATAR_JDATA_0     (0x1U<<8)
#define DFSDM_DFSDM2_JDATAR_JDATACH     (0x7U<<0)
#define DFSDM_DFSDM2_JDATAR_JDATACH_0   (0x1U<<0)

// DFSDM3_JDATAR Configuration

#define DFSDM_DFSDM3_JDATAR_JDATA       (0xFFFFFFU<<8)
#define DFSDM_DFSDM3_JDATAR_JDATA_0     (0x1U<<8)
#define DFSDM_DFSDM3_JDATAR_JDATACH     (0x7U<<0)
#define DFSDM_DFSDM3_JDATAR_JDATACH_0   (0x1U<<0)

// DFSDM0_RDATAR Configuration

#define DFSDM_DFSDM0_RDATAR_RDATA       (0xFFFFFFU<<8)
#define DFSDM_DFSDM0_RDATAR_RDATA_0     (0x1U<<8)
#define DFSDM_DFSDM0_RDATAR_RPEND       (0x1U<<4)
#define DFSDM_DFSDM0_RDATAR_RDATACH     (0x7U<<0)
#define DFSDM_DFSDM0_RDATAR_RDATACH_0   (0x1U<<0)

// DFSDM1_RDATAR Configuration

#define DFSDM_DFSDM1_RDATAR_RDATA       (0xFFFFFFU<<8)
#define DFSDM_DFSDM1_RDATAR_RDATA_0     (0x1U<<8)
#define DFSDM_DFSDM1_RDATAR_RPEND       (0x1U<<4)
#define DFSDM_DFSDM1_RDATAR_RDATACH     (0x7U<<0)
#define DFSDM_DFSDM1_RDATAR_RDATACH_0   (0x1U<<0)

// DFSDM2_RDATAR Configuration

#define DFSDM_DFSDM2_RDATAR_RDATA       (0xFFFFFFU<<8)
#define DFSDM_DFSDM2_RDATAR_RDATA_0     (0x1U<<8)
#define DFSDM_DFSDM2_RDATAR_RPEND       (0x1U<<4)
#define DFSDM_DFSDM2_RDATAR_RDATACH     (0x7U<<0)
#define DFSDM_DFSDM2_RDATAR_RDATACH_0   (0x1U<<0)

// DFSDM3_RDATAR Configuration

#define DFSDM_DFSDM3_RDATAR_RDATA       (0xFFFFFFU<<8)
#define DFSDM_DFSDM3_RDATAR_RDATA_0     (0x1U<<8)
#define DFSDM_DFSDM3_RDATAR_RPEND       (0x1U<<4)
#define DFSDM_DFSDM3_RDATAR_RDATACH     (0x7U<<0)
#define DFSDM_DFSDM3_RDATAR_RDATACH_0   (0x1U<<0)

// DFSDM0_AWHTR Configuration

#define DFSDM_DFSDM0_AWHTR_AWHT         (0xFFFFFFU<<8)
#define DFSDM_DFSDM0_AWHTR_AWHT_0       (0x1U<<8)
#define DFSDM_DFSDM0_AWHTR_BKAWH        (0xFU<<0)
#define DFSDM_DFSDM0_AWHTR_BKAWH_0      (0x1U<<0)

// DFSDM1_AWHTR Configuration

#define DFSDM_DFSDM1_AWHTR_AWHT         (0xFFFFFFU<<8)
#define DFSDM_DFSDM1_AWHTR_AWHT_0       (0x1U<<8)
#define DFSDM_DFSDM1_AWHTR_BKAWH        (0xFU<<0)
#define DFSDM_DFSDM1_AWHTR_BKAWH_0      (0x1U<<0)

// DFSDM2_AWHTR Configuration

#define DFSDM_DFSDM2_AWHTR_AWHT         (0xFFFFFFU<<8)
#define DFSDM_DFSDM2_AWHTR_AWHT_0       (0x1U<<8)
#define DFSDM_DFSDM2_AWHTR_BKAWH        (0xFU<<0)
#define DFSDM_DFSDM2_AWHTR_BKAWH_0      (0x1U<<0)

// DFSDM3_AWHTR Configuration

#define DFSDM_DFSDM3_AWHTR_AWHT         (0xFFFFFFU<<8)
#define DFSDM_DFSDM3_AWHTR_AWHT_0       (0x1U<<8)
#define DFSDM_DFSDM3_AWHTR_BKAWH        (0xFU<<0)
#define DFSDM_DFSDM3_AWHTR_BKAWH_0      (0x1U<<0)

// DFSDM0_AWLTR Configuration

#define DFSDM_DFSDM0_AWLTR_AWLT         (0xFFFFFFU<<8)
#define DFSDM_DFSDM0_AWLTR_AWLT_0       (0x1U<<8)
#define DFSDM_DFSDM0_AWLTR_BKAWL        (0xFU<<0)
#define DFSDM_DFSDM0_AWLTR_BKAWL_0      (0x1U<<0)

// DFSDM1_AWLTR Configuration

#define DFSDM_DFSDM1_AWLTR_AWLT         (0xFFFFFFU<<8)
#define DFSDM_DFSDM1_AWLTR_AWLT_0       (0x1U<<8)
#define DFSDM_DFSDM1_AWLTR_BKAWL        (0xFU<<0)
#define DFSDM_DFSDM1_AWLTR_BKAWL_0      (0x1U<<0)

// DFSDM2_AWLTR Configuration

#define DFSDM_DFSDM2_AWLTR_AWLT         (0xFFFFFFU<<8)
#define DFSDM_DFSDM2_AWLTR_AWLT_0       (0x1U<<8)
#define DFSDM_DFSDM2_AWLTR_BKAWL        (0xFU<<0)
#define DFSDM_DFSDM2_AWLTR_BKAWL_0      (0x1U<<0)

// DFSDM3_AWLTR Configuration

#define DFSDM_DFSDM3_AWLTR_AWLT         (0xFFFFFFU<<8)
#define DFSDM_DFSDM3_AWLTR_AWLT_0       (0x1U<<8)
#define DFSDM_DFSDM3_AWLTR_BKAWL        (0xFU<<0)
#define DFSDM_DFSDM3_AWLTR_BKAWL_0      (0x1U<<0)

// DFSDM0_AWSR Configuration

#define DFSDM_DFSDM0_AWSR_AWHTF         (0xFFU<<8)
#define DFSDM_DFSDM0_AWSR_AWHTF_0       (0x1U<<8)
#define DFSDM_DFSDM0_AWSR_AWLTF         (0xFFU<<0)
#define DFSDM_DFSDM0_AWSR_AWLTF_0       (0x1U<<0)

