Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_dfsdm.h
// DFSDM1_AWSR Configuration

#define DFSDM_DFSDM1_AWSR_AWHTF         (0xFFU<<8)
#define DFSDM_DFSDM1_AWSR_AWHTF_0       (0x1U<<8)
#define DFSDM_DFSDM1_AWSR_AWLTF         (0xFFU<<0)
#define DFSDM_DFSDM1_AWSR_AWLTF_0       (0x1U<<0)

// DFSDM2_AWSR Configuration

#define DFSDM_DFSDM2_AWSR_AWHTF         (0xFFU<<8)
#define DFSDM_DFSDM2_AWSR_AWHTF_0       (0x1U<<8)
#define DFSDM_DFSDM2_AWSR_AWLTF         (0xFFU<<0)
#define DFSDM_DFSDM2_AWSR_AWLTF_0       (0x1U<<0)

// DFSDM3_AWSR Configuration

#define DFSDM_DFSDM3_AWSR_AWHTF         (0xFFU<<8)
#define DFSDM_DFSDM3_AWSR_AWHTF_0       (0x1U<<8)
#define DFSDM_DFSDM3_AWSR_AWLTF         (0xFFU<<0)
#define DFSDM_DFSDM3_AWSR_AWLTF_0       (0x1U<<0)

// DFSDM0_AWCFR Configuration

#define DFSDM_DFSDM0_AWCFR_CLRAWHTF     (0xFFU<<8)
#define DFSDM_DFSDM0_AWCFR_CLRAWHTF_0   (0x1U<<8)
#define DFSDM_DFSDM0_AWCFR_CLRAWLTF     (0xFFU<<0)
#define DFSDM_DFSDM0_AWCFR_CLRAWLTF_0   (0x1U<<0)

// DFSDM1_AWCFR Configuration

#define DFSDM_DFSDM1_AWCFR_CLRAWHTF     (0xFFU<<8)
#define DFSDM_DFSDM1_AWCFR_CLRAWHTF_0   (0x1U<<8)
#define DFSDM_DFSDM1_AWCFR_CLRAWLTF     (0xFFU<<0)
#define DFSDM_DFSDM1_AWCFR_CLRAWLTF_0   (0x1U<<0)

// DFSDM2_AWCFR Configuration

#define DFSDM_DFSDM2_AWCFR_CLRAWHTF     (0xFFU<<8)
#define DFSDM_DFSDM2_AWCFR_CLRAWHTF_0   (0x1U<<8)
#define DFSDM_DFSDM2_AWCFR_CLRAWLTF     (0xFFU<<0)
#define DFSDM_DFSDM2_AWCFR_CLRAWLTF_0   (0x1U<<0)

// DFSDM3_AWCFR Configuration

#define DFSDM_DFSDM3_AWCFR_CLRAWHTF     (0xFFU<<8)
#define DFSDM_DFSDM3_AWCFR_CLRAWHTF_0   (0x1U<<8)
#define DFSDM_DFSDM3_AWCFR_CLRAWLTF     (0xFFU<<0)
#define DFSDM_DFSDM3_AWCFR_CLRAWLTF_0   (0x1U<<0)

// DFSDM0_EXMAX Configuration

#define DFSDM_DFSDM0_EXMAX_EXMAX        (0xFFFFFFU<<8)
#define DFSDM_DFSDM0_EXMAX_EXMAX_0      (0x1U<<8)
#define DFSDM_DFSDM0_EXMAX_EXMAXCH      (0x7U<<0)
#define DFSDM_DFSDM0_EXMAX_EXMAXCH_0    (0x1U<<0)

// DFSDM1_EXMAX Configuration

#define DFSDM_DFSDM1_EXMAX_EXMAX        (0xFFFFFFU<<8)
#define DFSDM_DFSDM1_EXMAX_EXMAX_0      (0x1U<<8)
#define DFSDM_DFSDM1_EXMAX_EXMAXCH      (0x7U<<0)
#define DFSDM_DFSDM1_EXMAX_EXMAXCH_0    (0x1U<<0)

// DFSDM2_EXMAX Configuration

#define DFSDM_DFSDM2_EXMAX_EXMAX        (0xFFFFFFU<<8)
#define DFSDM_DFSDM2_EXMAX_EXMAX_0      (0x1U<<8)
#define DFSDM_DFSDM2_EXMAX_EXMAXCH      (0x7U<<0)
#define DFSDM_DFSDM2_EXMAX_EXMAXCH_0    (0x1U<<0)

// DFSDM3_EXMAX Configuration

#define DFSDM_DFSDM3_EXMAX_EXMAX        (0xFFFFFFU<<8)
#define DFSDM_DFSDM3_EXMAX_EXMAX_0      (0x1U<<8)
#define DFSDM_DFSDM3_EXMAX_EXMAXCH      (0x7U<<0)
#define DFSDM_DFSDM3_EXMAX_EXMAXCH_0    (0x1U<<0)

// DFSDM0_EXMIN Configuration

#define DFSDM_DFSDM0_EXMIN_EXMIN        (0xFFFFFFU<<8)
#define DFSDM_DFSDM0_EXMIN_EXMIN_0      (0x1U<<8)
#define DFSDM_DFSDM0_EXMIN_EXMINCH      (0x7U<<0)
#define DFSDM_DFSDM0_EXMIN_EXMINCH_0    (0x1U<<0)

// DFSDM1_EXMIN Configuration

#define DFSDM_DFSDM1_EXMIN_EXMIN        (0xFFFFFFU<<8)
#define DFSDM_DFSDM1_EXMIN_EXMIN_0      (0x1U<<8)
#define DFSDM_DFSDM1_EXMIN_EXMINCH      (0x7U<<0)
#define DFSDM_DFSDM1_EXMIN_EXMINCH_0    (0x1U<<0)

// DFSDM2_EXMIN Configuration

#define DFSDM_DFSDM2_EXMIN_EXMIN        (0xFFFFFFU<<8)
#define DFSDM_DFSDM2_EXMIN_EXMIN_0      (0x1U<<8)
#define DFSDM_DFSDM2_EXMIN_EXMINCH      (0x7U<<0)
#define DFSDM_DFSDM2_EXMIN_EXMINCH_0    (0x1U<<0)

// DFSDM3_EXMIN Configuration

#define DFSDM_DFSDM3_EXMIN_EXMIN        (0xFFFFFFU<<8)
#define DFSDM_DFSDM3_EXMIN_EXMIN_0      (0x1U<<8)
#define DFSDM_DFSDM3_EXMIN_EXMINCH      (0x7U<<0)
#define DFSDM_DFSDM3_EXMIN_EXMINCH_0    (0x1U<<0)

// DFSDM0_CNVTIMR Configuration

#define DFSDM_DFSDM0_CNVTIMR_CNVCNT     (0xFFFFFFFU<<4)
#define DFSDM_DFSDM0_CNVTIMR_CNVCNT_0   (0x1U<<4)

// DFSDM1_CNVTIMR Configuration

#define DFSDM_DFSDM1_CNVTIMR_CNVCNT     (0xFFFFFFFU<<4)
#define DFSDM_DFSDM1_CNVTIMR_CNVCNT_0   (0x1U<<4)

// DFSDM2_CNVTIMR Configuration

#define DFSDM_DFSDM2_CNVTIMR_CNVCNT     (0xFFFFFFFU<<4)
#define DFSDM_DFSDM2_CNVTIMR_CNVCNT_0   (0x1U<<4)

// DFSDM3_CNVTIMR Configuration

#define DFSDM_DFSDM3_CNVTIMR_CNVCNT     (0xFFFFFFFU<<4)
#define DFSDM_DFSDM3_CNVTIMR_CNVCNT_0   (0x1U<<4)
